modm-io/modm/src/xpcc/architecture/platform/arm7/lpc/device/lpc23xx_24xx.h
#define USBOTG_I2C_BASE_ADDR	0xFFE0C300
#define OTG_I2C_RX          (*(volatile unsigned long *)(USBOTG_I2C_BASE_ADDR + 0x00))
#define OTG_I2C_TX          (*(volatile unsigned long *)(USBOTG_I2C_BASE_ADDR + 0x00))
#define OTG_I2C_STS         (*(volatile unsigned long *)(USBOTG_I2C_BASE_ADDR + 0x04))
#define OTG_I2C_CTL         (*(volatile unsigned long *)(USBOTG_I2C_BASE_ADDR + 0x08))
#define OTG_I2C_CLKHI       (*(volatile unsigned long *)(USBOTG_I2C_BASE_ADDR + 0x0C))
#define OTG_I2C_CLKLO       (*(volatile unsigned long *)(USBOTG_I2C_BASE_ADDR + 0x10))

/* On LPC23xx, the names are USBClkCtrl and USBClkSt; on LPC24xx, the names are 
OTG_CLK_CTRL and OTG_CLK_STAT respectively. */
#define USBOTG_CLK_BASE_ADDR	0xFFE0CFF0
#define OTG_CLK_CTRL        (*(volatile unsigned long *)(USBOTG_CLK_BASE_ADDR + 0x04))
#define OTG_CLK_STAT        (*(volatile unsigned long *)(USBOTG_CLK_BASE_ADDR + 0x08))

/* Note: below three register name convention is for LPC23xx USB device only, match
with the spec. update in USB Device Section. */ 
#define USBPortSel          (*(volatile unsigned long *)(USBOTG_BASE_ADDR + 0x10))
#define USBClkCtrl          (*(volatile unsigned long *)(USBOTG_CLK_BASE_ADDR + 0x04))
#define USBClkSt            (*(volatile unsigned long *)(USBOTG_CLK_BASE_ADDR + 0x08))

/* Ethernet MAC (32 bit data bus) -- all registers are RW unless indicated in parentheses */
#define MAC_BASE_ADDR		0xFFE00000 /* AHB Peripheral # 0 */
#define MAC_MAC1            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x000)) /* MAC config reg 1 */
#define MAC_MAC2            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x004)) /* MAC config reg 2 */
#define MAC_IPGT            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x008)) /* b2b InterPacketGap reg */
#define MAC_IPGR            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x00C)) /* non b2b InterPacketGap reg */
#define MAC_CLRT            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x010)) /* CoLlision window/ReTry reg */
#define MAC_MAXF            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x014)) /* MAXimum Frame reg */
#define MAC_SUPP            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x018)) /* PHY SUPPort reg */
#define MAC_TEST            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x01C)) /* TEST reg */
#define MAC_MCFG            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x020)) /* MII Mgmt ConFiG reg */
#define MAC_MCMD            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x024)) /* MII Mgmt CoMmanD reg */
#define MAC_MADR            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x028)) /* MII Mgmt ADdRess reg */
#define MAC_MWTD            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x02C)) /* MII Mgmt WriTe Data reg (WO) */
#define MAC_MRDD            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x030)) /* MII Mgmt ReaD Data reg (RO) */
#define MAC_MIND            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x034)) /* MII Mgmt INDicators reg (RO) */

#define MAC_SA0             (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x040)) /* Station Address 0 reg */
#define MAC_SA1             (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x044)) /* Station Address 1 reg */
#define MAC_SA2             (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x048)) /* Station Address 2 reg */

#define MAC_COMMAND         (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x100)) /* Command reg */
#define MAC_STATUS          (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x104)) /* Status reg (RO) */
#define MAC_RXDESCRIPTOR    (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x108)) /* Rx descriptor base address reg */
#define MAC_RXSTATUS        (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x10C)) /* Rx status base address reg */
#define MAC_RXDESCRIPTORNUM (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x110)) /* Rx number of descriptors reg */
#define MAC_RXPRODUCEINDEX  (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x114)) /* Rx produce index reg (RO) */
#define MAC_RXCONSUMEINDEX  (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x118)) /* Rx consume index reg */
#define MAC_TXDESCRIPTOR    (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x11C)) /* Tx descriptor base address reg */
#define MAC_TXSTATUS        (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x120)) /* Tx status base address reg */
#define MAC_TXDESCRIPTORNUM (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x124)) /* Tx number of descriptors reg */
#define MAC_TXPRODUCEINDEX  (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x128)) /* Tx produce index reg */
#define MAC_TXCONSUMEINDEX  (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x12C)) /* Tx consume index reg (RO) */

#define MAC_TSV0            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x158)) /* Tx status vector 0 reg (RO) */
#define MAC_TSV1            (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x15C)) /* Tx status vector 1 reg (RO) */
#define MAC_RSV             (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x160)) /* Rx status vector reg (RO) */

#define MAC_FLOWCONTROLCNT  (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x170)) /* Flow control counter reg */
#define MAC_FLOWCONTROLSTS  (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x174)) /* Flow control status reg */

#define MAC_RXFILTERCTRL    (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x200)) /* Rx filter ctrl reg */
#define MAC_RXFILTERWOLSTS  (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x204)) /* Rx filter WoL status reg (RO) */
#define MAC_RXFILTERWOLCLR  (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x208)) /* Rx filter WoL clear reg (WO) */

#define MAC_HASHFILTERL     (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x210)) /* Hash filter LSBs reg */
#define MAC_HASHFILTERH     (*(volatile unsigned long *)(MAC_BASE_ADDR + 0x214)) /* Hash filter MSBs reg */

#define MAC_INTSTATUS       (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFE0)) /* Interrupt status reg (RO) */
#define MAC_INTENABLE       (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFE4)) /* Interrupt enable reg  */
#define MAC_INTCLEAR        (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFE8)) /* Interrupt clear reg (WO) */
#define MAC_INTSET          (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFEC)) /* Interrupt set reg (WO) */

#define MAC_POWERDOWN       (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFF4)) /* Power-down reg */
#define MAC_MODULEID        (*(volatile unsigned long *)(MAC_BASE_ADDR + 0xFFC)) /* Module ID reg (RO) */

// ----------------------------------------------------------------------------
/* Some bit-mask definitions - mthomas */

/* Timers */
#define TxIR_MR0_Interrupt	(1UL<<0)
#define TxIR_MR1_Interrupt	(1UL<<1)
#define TxIR_MR2_Interrupt	(1UL<<2)
#define TxIR_MR3_Interrupt	(1UL<<3)
#define TxIR_CR0_Interrupt	(1UL<<4)
#define TxIR_CR1_Interrupt	(1UL<<5)
#define TxIR_CR2_Interrupt	(1UL<<6)
#define TxIR_CR3_Interrupt	(1UL<<7)

#define TxTCR_Counter_Enable	(1UL<<0)
#define TxTCR_Counter_Reset		(1UL<<1)

#define TxMCR_MR0I	(1UL<<0)
#define TxMCR_MR0R	(1UL<<1)
#define TxMCR_MR0S	(1UL<<2)
#define TxMCR_MR1I	(1UL<<3)
#define TxMCR_MR1R	(1UL<<4)
#define TxMCR_MR1S	(1UL<<5)
#define TxMCR_MR2I	(1UL<<6)
#define TxMCR_MR2R	(1UL<<7)
#define TxMCR_MR2S	(1UL<<8)
#define TxMCR_MR3I	(1UL<<9)
#define TxMCR_MR3R	(1UL<<10)
#define TxMCR_MR3S	(1UL<<11)

/* VIC */
#define VIC_CHAN_NUM_WDT		0
#define VIC_CHAN_NUM_UNUSED		1
#define VIC_CHAN_NUM_ARM_Core_DgbCommRX	2
#define VIC_CHAN_NUM_ARM_Core_DbgCommTX	3
#define VIC_CHAN_NUM_Timer0		4
#define VIC_CHAN_NUM_Timer1		5
#define VIC_CHAN_NUM_UART0		6
#define VIC_CHAN_NUM_UART1		7
#define VIC_CHAN_NUM_PWM1		8
#define VIC_CHAN_NUM_I2C0		9
#define VIC_CHAN_NUM_SPI		10
#define VIC_CHAN_NUM_SSP0		10
#define VIC_CHAN_NUM_SSP1		11
#define VIC_CHAN_NUM_PLL		12
#define VIC_CHAN_NUM_RTC		13
#define VIC_CHAN_NUM_EINT0		14
#define VIC_CHAN_NUM_EINT1		15
#define VIC_CHAN_NUM_EINT2		16
#define VIC_CHAN_NUM_EINT3		17
#define VIC_CHAN_NUM_ADC0		18
#define VIC_CHAN_NUM_I2C1		19
#define VIC_CHAN_NUM_BOD		20
#define VIC_CHAN_NUM_Ethernet	21
#define VIC_CHAN_NUM_USB		22
#define VIC_CHAN_NUM_CAN		23
#define VIC_CHAN_NUM_SD_MMC		24
#define VIC_CHAN_NUM_GP_DMA		25
#define VIC_CHAN_NUM_Timer2		26
#define VIC_CHAN_NUM_Timer3		27
#define VIC_CHAN_NUM_UART2		28
#define VIC_CHAN_NUM_UART3		29
#define VIC_CHAN_NUM_I2C2		30
#define VIC_CHAN_NUM_I2S		31

#define VIC_CHAN_TO_MASK(vctm_chan_num__) (1UL<<vctm_chan_num__)

// ----------------------------------------------------------------------------
//Interrupt Bit Allocation Table
union _INTAT
{
	unsigned volatile long wordreg;
	struct
	{	volatile unsigned	WDT	  	: 1;
		volatile unsigned		  	: 1;
		volatile unsigned	ARMCore0: 1;
		volatile unsigned	ARMCore1: 1;
		volatile unsigned	TIMER0  : 1;
		volatile unsigned	TIMER1  : 1;
		volatile unsigned	UART0  	: 1;
		volatile unsigned	UART1  	: 1;
		volatile unsigned	PWM  	: 1;
		volatile unsigned	I2C0  	: 1;
		volatile unsigned	SPISPP0	: 1;
		volatile unsigned	SSP1  	: 1;
		volatile unsigned	PLL  	: 1;
		volatile unsigned	RTC  	: 1;
		volatile unsigned	EINT0  	: 1;
		volatile unsigned	EINT1  	: 1;
		volatile unsigned	EINT2  	: 1;
		volatile unsigned	EINT3  	: 1;
		volatile unsigned	ADC  	: 1;
		volatile unsigned	I2C1  	: 1;
		volatile unsigned	BOD  	: 1;
		volatile unsigned	ETHNET	: 1;
		volatile unsigned	USB		: 1;
		volatile unsigned	CAN  	: 1;
		volatile unsigned	SDC  	: 1;
		volatile unsigned	GPDMA  	: 1;
		volatile unsigned	TIMER2  : 1;
		volatile unsigned	TIMER3  : 1;
		volatile unsigned	UART2  	: 1;
		volatile unsigned	UART3  	: 1;
		volatile unsigned	I2C2  	: 1;
		volatile unsigned	I2S  	: 1;		
	} peripheral;
};

// ----------------------------------------------------------------------------
 //Timer Match Control Register
union _TxMCR
{
	unsigned volatile short wordreg;
	struct
	{	volatile unsigned	MR0I  	: 1;
		volatile unsigned	MR0R  	: 1;
		volatile unsigned	MR0S  	: 1;
		volatile unsigned	MR1I  	: 1;
		volatile unsigned	MR1R  	: 1;
		volatile unsigned	MR1S  	: 1;
		volatile unsigned	MR2I  	: 1;
		volatile unsigned	MR2R  	: 1;
		volatile unsigned	MR2S  	: 1;
		volatile unsigned	MR3I  	: 1;
		volatile unsigned	MR3R  	: 1;
		volatile unsigned	MR3S  	: 1;
		volatile unsigned			: 4;
	} function;
};


struct _TxTCR
{
		volatile unsigned	enable  : 1;
		volatile unsigned	reset  	: 1;	
};

//CountTimMode Values:
#define TimMod	0			//Timer Mode: every rising PCLK edge
//Counter Mode: the CAP input selected by CountInSel
#define risCount	1		//Counter Mode: TC is incremented on rising edges
#define fallCount	2		//Counter Mode: TC is incremented on falling edges
#define bothCount	3		//Counter Mode: TC is incremented on both edges

#define CAP0		0		//CAPn.0 for TIMERn
#define CAP1		1		//CAPn.1 for TIMERn


struct _TxCTCR
{
		volatile unsigned	CountTimMode 	: 2;
		volatile unsigned	CountInSel		: 2;
};

struct _TxCCR
{
		volatile unsigned	CAP0RE 	: 1; 	//Capture on CAPn.0 rising edge: a sequence of 0 then 1 on
									//CAPn.0 will cause CR0 to be loaded with the contents of TC.

		volatile unsigned	CAP0FE	: 1;	//Capture on CAPn.0 falling edge: a sequence of 1 then 0 on
									//CAPn.0 will cause CR0 to be loaded with the contents of TC.

		volatile unsigned	CAP0I 	: 1;	//Interrupt on CAPn.0 event: a CR0 load due to a CAPn.0 event
									//will generate an interrupt.

		volatile unsigned	CAP1RE	: 1;	//Capture on CAPn.1 rising edge: a sequence of 0 then 1 on
									//CAPn.1 will cause CR1 to be loaded with the contents of TC.

