modm-io/modm/src/xpcc/architecture/platform/arm7/lpc/device/lpc23xx_24xx.h
		volatile unsigned	CAP1FE 	: 1;	//Capture on CAPn.1 falling edge: a sequence of 1 then 0 on
									//CAPn.1 will cause CR1 to be loaded with the contents of TC.

		volatile unsigned	CAP1I	: 1;	//Interrupt on CAPn.1 event: a CR1 load due to a CAPn.1 event
									//will generate an interrupt.

		volatile unsigned		 	: 10;

};


struct _TxEMR
{
		volatile unsigned	EM0 	: 1;  	//External Match 0. 
									//When a match occurs between the TC and MR0, this 
									//bit can either toggle, go low, go high, or do nothing, depending on bits 5:4
									//of this register. This bit can be driven onto a MATn.0 pin, in a
									//positive-logic manner (0 = low, 1 = high).
		volatile unsigned	EM1		: 1;	//External Match 1
		volatile unsigned	EM2 	: 1;	//External Match 2
		volatile unsigned	EM3		: 1;	//External Match 3
		volatile unsigned	EMC0 	: 2;	//External Match Control 0. Determines the functionality of External Match 0.
		volatile unsigned	EMC1 	: 2;	//External Match Control 1. Determines the functionality of External Match 1.
		volatile unsigned	EMC2 	: 2;	//External Match Control 2. Determines the functionality of External Match 2.
		volatile unsigned	EMC3	: 2;	//External Match Control 3. Determines the functionality of External Match 3.
		volatile unsigned		 	: 4;

};

struct _TxIR
{
		volatile unsigned	MR0I  : 1;
		volatile unsigned	MR1I  : 1;
		volatile unsigned	MR2I  : 1;
		volatile unsigned	MR3I  : 1;
		volatile unsigned	CR0I  : 1;
		volatile unsigned	CR1I  : 1;
		volatile unsigned	CR2I  : 1;
		volatile unsigned	CR3I  : 1;	
};

// ----------------------------------------------------------------------------
//power config register
union _PCONP
{
	unsigned volatile long wordreg;
	struct
	{	volatile unsigned		  	: 1;
		volatile unsigned	TIMER0  : 1;
		volatile unsigned	TIMER1  : 1;
		volatile unsigned	UART0  	: 1;
		volatile unsigned	UART1  	: 1;
		volatile unsigned	PWM0  	: 1;
		volatile unsigned	PWM1  	: 1;
		volatile unsigned	I2C0  	: 1;
		volatile unsigned	SPI  	: 1;
		volatile unsigned	RTC  	: 1;
		volatile unsigned	SSP1  	: 1;
		volatile unsigned	EMC  	: 1;
		volatile unsigned	ADC  	: 1;
		volatile unsigned	CAN1  	: 1;
		volatile unsigned	CAN2  	: 1;
		volatile unsigned		  	: 4;
		volatile unsigned	I2C1  	: 1;
		volatile unsigned  	LCD		: 1;
		volatile unsigned	SSP0  	: 1;
		volatile unsigned	TIMER2  : 1;
		volatile unsigned	TIMER3  : 1;
		volatile unsigned	UART2  	: 1;
		volatile unsigned	UART3  	: 1;
		volatile unsigned	I2C2  	: 1;
		volatile unsigned	I2S  	: 1;
		volatile unsigned	SDC  	: 1;
		volatile unsigned	GPDMA  	: 1;
		volatile unsigned	ETHNET	: 1;
		volatile unsigned	USB		: 1;
	} peripheral;
};

// ----------------------------------------------------------------------------
//pclk selection registers
union _PCLKSEL0
{
	unsigned volatile long wordreg;
	struct
	{
		volatile unsigned	WDT  	: 2;
		volatile unsigned	TIMER0  : 2;
		volatile unsigned	TIMER1  : 2;
		volatile unsigned	UART0  	: 2;
		volatile unsigned	UART1  	: 2;
		volatile unsigned	PWM0  	: 2;
		volatile unsigned	PWM1  	: 2;
		volatile unsigned	I2C0  	: 2;
		volatile unsigned	SPI  	: 2;
		volatile unsigned	RTC  	: 2;
		volatile unsigned	SSP1  	: 2;
		volatile unsigned	DAC  	: 2;
		volatile unsigned	ADC  	: 2;
		volatile unsigned	CAN1  	: 2;
		volatile unsigned	CAN2  	: 2;
		volatile unsigned	ACF  	: 2;
	} peripheral;
};

union _PCLKSEL1
{
	unsigned volatile long wordreg;
	struct
	{
		volatile unsigned BAT_RAM : 2;
		volatile unsigned GPIO  	: 2;
		volatile unsigned PCB  	: 2;
		volatile unsigned I2C1  	: 2;
		volatile unsigned  			: 2;
		volatile unsigned SSP0  	: 2;
		volatile unsigned TIMER2  : 2;
		volatile unsigned TIMER3  : 2;
		volatile unsigned UART2  	: 2;
		volatile unsigned UART3  	: 2;
		volatile unsigned I2C2  	: 2;
		volatile unsigned I2S  	: 2;
		volatile unsigned MCI  	: 2;
		volatile unsigned		  	: 2;
		volatile unsigned SYSCON  : 2;
		volatile unsigned			: 2;
	} peripheral;
};

// ----------------------------------------------------------------------------
#define T0MCR_p		((union _TxMCR *) &T0MCR)
#define T1MCR_p		((union _TxMCR *) &T1MCR)
#define T2MCR_p		((union _TxMCR *) &T2MCR)
#define T3MCR_p		((union _TxMCR *) &T3MCR)

#define T0TCR_p		((struct _TxTCR *) &T0TCR)
#define T1TCR_p		((struct _TxTCR *) &T1TCR)
#define T2TCR_p		((struct _TxTCR *) &T2TCR)
#define T3TCR_p		((struct _TxTCR *) &T3TCR)

#define T0CTCR_p	((struct _TxCTCR *) &T0CTCR)
#define T1CTCR_p	((struct _TxCTCR *) &T1CTCR)
#define T2CTCR_p	((struct _TxCTCR *) &T2CTCR)
#define T3CTCR_p	((struct _TxCTCR *) &T3CTCR)

#define T0CCR_p		((struct _TxCCR *) &T0CCR)
#define T1CCR_p		((struct _TxCCR *) &T1CCR)
#define T2CCR_p		((struct _TxCCR *) &T2CCR)
#define T3CCR_p		((struct _TxCCR *) &T3CCR)

#define T0IR_p		((struct _TxIR *) &T0IR)
#define T1IR_p		((struct _TxIR *) &T1IR)
#define T2IR_p		((struct _TxIR *) &T2IR)
#define T3IR_p		((struct _TxIR *) &T3IR)

#define PCONP_p		((union _PCONP *) &PCONP)
#define PCLKSEL0_p	((union _PCLKSEL0 *) &PCLKSEL0)
#define PCLKSEL1_p	((union _PCLKSEL1 *) &PCLKSEL0)

// ----------------------------------------------------------------------------
//PCLK_xyz = CCLK
#ifndef setCCLK
#define setCCLK		1
#endif

//PCLK_xyz = CCLK/2
#ifndef setCCLKD2
#define setCCLKD2	2
#endif

//PCLK_xyz = CCLK/4
#ifndef setCCLKD4
#define setCCLKD4	0
#endif

//PCLK_xyz = CCLK/8
#ifndef setCCLKD8
#define setCCLKD8	3
#endif

//Peripheral clock is selected to PCLK_xyz = CCLK/8
//except for CAN1, CAN2, and CAN filtering when Æ11Æ
//selects PCLK_xyz = CCLK/6.
#ifndef setCCLKD6
#define setCCLKD6	3
#endif

#endif	// LPC23xx_24xx_REGISTERS_H
